### Plan: 2 to add, 0 to change, 0 to destroy.
```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# aws_s3_bucket.app will be created
+ resource "aws_s3_bucket" "app" {
    + acceleration_status         = (known after apply)
    + acl                         = "public-read"
    + arn                         = (known after apply)
    + bucket                      = (known after apply)
    + bucket_domain_name          = (known after apply)
    + bucket_regional_domain_name = (known after apply)
    + force_destroy               = false
    + hosted_zone_id              = (known after apply)
    + id                          = (known after apply)
    + region                      = (known after apply)
    + request_payer               = (known after apply)
    + tags                        = {
        + "Environment" = "stg"
        + "Terraform"   = "true"
      }
    + website_domain              = (known after apply)
    + website_endpoint            = (known after apply)

    + versioning {
        + enabled    = (known after apply)
        + mfa_delete = (known after apply)
      }

    + website {
        + index_document = "index.html"
      }
  }

# aws_s3_bucket_object.app will be created
+ resource "aws_s3_bucket_object" "app" {
    + acl                    = "public-read"
    + bucket                 = (known after apply)
    + content                = "<h1>Welcome to the stg environment</h1>"
    + content_type           = "text/html"
    + etag                   = (known after apply)
    + force_destroy          = false
    + id                     = (known after apply)
    + key                    = "index.html"
    + server_side_encryption = (known after apply)
    + storage_class          = (known after apply)
    + tags                   = {
        + "Environment" = "stg"
        + "Terraform"   = "true"
      }
    + version_id             = (known after apply)
  }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ s3_bucket_url = (known after apply)

```
